# LoadClassification Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaBasedLoadData..::..LoadClassification Property
AreaBasedLoadData Class See Also
---
The load classification of the area based load.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public ElementId LoadClassification { get; }
```

Visual Basic
---
```text
Public ReadOnly Property LoadClassification As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ LoadClassification {
	ElementId^ get ();
}
```

# See Also
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace